cases/00-tutorials/P2D-par/constant/timeVsLaserPosition1
(
    (0    (0 0.005 0.01))
    (1    (0 0.005 -0.59))
)